Tekla Open API Reference for Tekla Structures 2025
NumericConstantFilterExpression Constructor (IEnumerable<TeklaStructuresDatabaseTypeEnum>)
 Initializes a new instance of the NumericConstantFilterExpression class.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public NumericConstantFilterExpression(
	IEnumerable<TeklaStructuresDatabaseTypeEnum> ObjectTypes
)
Public Sub New (
	ObjectTypes As IEnumerable(Of TeklaStructuresDatabaseTypeEnum)
)
Parameters
ObjectTypes
Type: System.Collections.Generic.IEnumerable<TeklaStructuresDatabaseTypeEnum>
The values to represent.
See Also
Reference
NumericConstantFilterExpression Class
NumericConstantFilterExpression Overload
Tekla.Structures.Filtering Namespace